{
  "0": {
    "maintitle": "The start of my coding journey",
    "description": "The world of programming is too immense for a 12-year-old boy, isn't it? How I learned about game development and started creating my own communities.",
    "image": "/code1.jpeg",
    "content": [
      ["title", "My beginnings in programming"],
      ["p", "When I was 12 years old, I loved playing video games. It was my favorite hobby, and I spent countless hours in front of the computer testing new game releases and chatting with gaming communities. While I knew programming existed, learning to code never crossed my mind."],
      ["p", "My introduction to the world of coding was quite interesting. One day, while watching YouTube videos about the famous game \"Geometry Dash,\" I stumbled upon a tutorial for Cocos2D, the program used to develop the game. I clicked out of curiosity, unaware that I was stepping into the world that would shape my future."],
      ["p", "The program seemed quite complex, and my 12-year-old self didn't understand anything. However, in the comments of the video, a wonderful person (whom I am grateful for) appeared and explained that a simpler tool called \"Game Maker\" existed."],
      ["p", "Driven by curiosity, I searched for \"Game Maker\" on YouTube and watched the first tutorial that appeared in Spanish."],
      ["galery", ["/gm1.png"]],
      ["p", "After watching the videos, I found the way the games were created interesting. I installed the program on my mother's laptop and started trying things out. I have to admit that I didn't really understand what I was doing, but I followed the tutorials and my games worked. The program had a Drag and Drop system similar to Scratch, making it much easier for my 12-year-old self to learn."],
      ["p", "Those actions were my first \"Hello World\", that's when my journey began."],
      ["divider", "-"],
      ["p", "When I created my first games and showed them to my friends, they were amazed. Obviously, my creations weren't anything extraordinary, but we were young and easily impressed by anything wonderful."],
      ["imgleft", "/gm2.png"],
      ["p", "In addition to Drag and Drop, the program came with its own language called GML, which allowed you to create more complex and professional games. So, when I turned 13, I made a decision to put effort into learning it."],
      ["p", "And there I was! A 13-year-old boy learning if statements, for loops, arrays, and algorithms. Obviously, my code was horrible. I didn't even know that a switch statement existed, so I created infinite if chains. But my code worked! And I was so proud of it."],
      ["subtitle", "Jumping World:"],
      ["imgright", "/jw2.jpg"],
      ["p", "At that age, I met another young boy who was also coding with Game Maker. We decided to collaborate on a project called \"Jumping World\" (which we decided to remaster in 2024, but that's for another post!)"],
      ["p", "That was the best experience I've ever had on my coding journey. My friend was gifted. He started coding when he was 8, and he had knowledge on how to write clean and effective code. So, when he saw my code... well, let's just say he screamed in horror."],
      ["p", "He taught me every clean code technique: the switch statements, how to manipulate arrays correctly, how to manage external files, etc. Most of the things I know about programming now are thanks to the Jumping World experience."],
      ["subtitle", "The dark phase of my life:"],
      ["p", "2021 was the worst year of my life, if you want to read more specifically about this topic, I recommend the following article:"],
      ["link", ["/article/3", "The worst year of my life (The weak boy becoming the most confident of his class)"]],
      ["p", "I spent 2021 - 2023 without using Game Maker. Then, by July of 2023, when I was mentally okay, I decided to learn HTML, CSS, and JavaScript. That was the best decision I've ever made because all the GameMaker experience helped me learn JavaScript very quickly. The only new things were array methods, functions, and DOM manipulation."],
      ["p", "And here we are! In 2024, at 17 years old, I'm learning TypeScript, React, and then I'll move on to backend and Python. Such an interesting journey, full of game development."],
      ["subtitle", "Thank you for reading my story, I'm glad you were interested!"]
    ]
  },
  "1": {
    "maintitle": "Social Media in young people",
    "description": "How do they work? Why are they so important for young people? How they affect behavior? All of this is answered with my experience living them day by day.",
    "image": "/friends1.jpeg",
    "content": [
      ["title", "The generation of instant gratification"],
      ["p", "First, let's talk about the things I consider positive about social media."],
      ["p", "I didn't install Instagram until I was 15. You might think that maybe that's a very good thing, but the truth is, it's not. I was a very social person, and not being on this app made me, so to speak, invisible. Nowadays, your Instagram account is like your letter of introduction to new young people."],
      ["imgleft", "/instagram1.jpg"],
      ["p", "Let me explain. Depending on your age or location, this may sound strange, but there are people who, when they see someone attractive on the street, the first thing they do is ask for their Instagram. Do you understand the point?"],
      ["p", "I want to start by talking about this app, which is the one I have the most experience with, to be able to show you how it can be a tool instead of a waste of time if it's used correctly."],
      ["p", "Since I made my account in 2022 and worried about having a good profile, I've met and talked to new people, learned a lot of things from others, and understood many current concepts. Does Instagram somehow improve your social skills as a young person? Yes, it does. As much as it may be hard to admit, this social media platform is the only one that helps you establish a good image in front of other young people."],
      ["p", "But don't get me wrong, I'm not saying that people who don't have Instagram or aren't active on the platform are considered friendless social failures. Each person is different and having Instagram does not make you better or worse. I'm only commenting on the meaning that young people give it. If you want to be someone who works in the shadows and doesn't want to be distracted by social things, it seems completely acceptable to me that you don't want to install this app, I'm not at all recommending that you be the same as others."],
      ["p", "That's why I want you to delve into this complex and, at times, immature world of Instagram, in which today's young people are immersed."],
      ["galery", ["/friends1.jpeg"]],
      ["subtitle", "Behaviours on Instagram:"],
      ["p", "The normal thing is that you upload to your Instagram story if you have done something interesting that day, and here a curious behavior comes into play: the likes on the stories. If you upload a photo at the gym showing your muscles, and a guy likes it, what does it mean? Does he think you have very good results? Does he like the photo? Does he like you? You will never know. You will have to deduce it depending on who the person is."],
      ["p", "When you are interested in someone, the most \"normal\" thing to do to get their attention and give them signs is to start following them on Instagram and occasionally like their stories. In fact, it's not uncommon for strangers to message you on your Instagram account, so I have met many people who are my friends today. This way, if you like someone, you can simply talk to them through this app and see if they engage in the conversation."],
      ["imgright", "/instagram2.jpg"],
      ["p", "But of course, just because someone talks to you or likes your stories doesn't mean they like you. That's the problem with Instagram; you never know what people's intentions are."],
      ["p", "This leads to a current problem for young people: they are very paranoid when it comes to social media. They give too much importance to who sees their stories, who likes them, who talks to them, who views their account, who liked X reel, etc. I personally have already been through this, and I can say that letting yourself be manipulated by these stimuli is the most depressing feeling that exists."],
      ["p", "I still have Instagram, but I use it very occasionally. As I said before, the idea is to know how to use it well. The only two things I do in this app are: polish my profile to have a good image and watch reels and stories from certain people who I think create good content."],
      ["p", "But it's too much Instagram for now. Let's talk about other social medias:"],
      ["subtitle", "Twitter / X"],
      ["p", "There aren't too many things to talk about this platform. Not many young people use it to create content. They typically post hints of love and retweet posts with which they feel identified. From time to time it gets interesting when there are fights within the posts. That's another use they give to social media: fighting and criticizing each other, and Twitter is usually the most common place where these things happen."],
      ["subtitle", "TikTok"],
      ["p", "Probably the most used among young people, but I can't say much since I never used it. I only installed it once, and it was the most disgusting thing I've ever seen in my life."],
      ["p", "Studying the behavior of young people on this app would be enough for another entire article..."],
      ["galery", ["/tiktok.jpg"]],
      ["subtitle", "WhatsApp"],
      ["p", "There are two types of young people: The mysterious ones who have their last seen and online status deactivated, in addition to having the option to delete messages that have been in the chat history for a long time. And then there are those who don't change any settings, the \"paranoid\" ones who look at the last time someone was online and start overthinking about it."],
      ["divider", "-"],
      ["p", "In conclusion, social medias are a medium that defines the behavior and image of young people today. If you are older, you may not fully understand the reason for this, but as a 17-year-old boy who lives in the digital generation, these experiences are very real, and many times parents are not present in their children's lives to explain what is wrong and what is right to do on the Internet."]
    ]
  },
  "2": {
    "maintitle": "My experience in high school",
    "description": "Best or worst years? Is the education system beneficial? Are grades important? Be surprised by the point of view of young people today.",
    "image": "/me5.jpg",
    "content": [
      ["title", "Best or worst years?"],
      ["p", "The high school journey is a roller coaster. My first year was in 2020, just witht the Covid-19 pandemic. Here in Argentina, classes start in March and end in December, so I went to school for two weeks in March, and then the rest was virtual. I don't remember much about that year because most of the assignments were Words and PowerPoints in which you had to answer questions and send them by email to the teachers. It was extremely easy, especially because they gave a lot of time to hand in the assignments, and I finished them all on the first day they were assigned. It was like being on vacation for a whole year."],
      ["p", "Then the second year began, where I noticed the consequences that the pandemic had on the educational system. From March to October, it was in-person/virtual, divided by student bubbles, until in November it became 100% in-person. At that moment I didn't know what high school was; the first years were practically lost, which affected me a lot in the third year."],
      ["imgleft", "/friends2.jpg"],
      ["p", "When 2022 began, I was changing and working on myself, and the fact that I started attending school for many more hours every day after 2 years in the pandemic was hard. Luckily, I was able to adapt quickly, but it was not the same with my other colleagues. I completely understand the people in my grade who found the third year of high school the hardest. How did the teachers expect that, after 2 abnormal years, we would adapt well to the normal flow of high school? That's crazy. But hey, if you think about it, life is like that; you have to adapt to any environment."],
      ["p", "For me, third year was much calmer (in terms of classroom chaos) than second year. There were more subjects, so we had to study more. That was the moment in my life when I started to love mathematics. The first two years we had a teacher who taught very badly and who also spent classes telling us that we were failures (I'm not lying to you, this is 100% real and I may write about it in another article), so my passion for this subject never came up, but when I met the new teacher, everything changed."],
      ["imgright", "/me7.jpeg"],
      ["p", "After 2022, I became a more confident person. I started fourth year in a school specialized in business administration, and there were new subjects like SIC (Sistemas de Información Contable, which translated into English would be Accounting Information Systems), administration, and human resources. These subjects were my favorites, especially SIC; I loved working with numbers."],
      ["p", "This year was special for me because I learned a lot of things about myself. Not only on a personal side but also on a social side. The activities that they proposed to us in groups made me adapt to anyone I met, something that will help me a lot in life (not like the other subjects they teach...)"],
      ["p", "At the time I write this article (February 22, 2024), I'm one week away from starting the fifth year. In Argentina, high school is six years, so I still have 2 years left to finish it."],
      ["p", "As a summary of my entire history through high school, I'm going to answer some questions about it:"],
      ["subtitle", "Is high school useful?"],
      ["imgleft", "/me5.jpg"],
      ["p", "It depends on what we are referring to. If we talk about the learning that you take away after studying the subjects, they are completely useless if you're not going to apply them in everyday life. I don't remember absolutely anything I saw in Geography last year. Do you think I'm going to remember what I studied the first year in Biology?"],
      ["p", "But, on the other hand, I think that high school is useful if we are talking about the experience that this stage gives you. I already know that I want to be a programmer; I could simply leave school and study this career full time online, but why don't I do it? Because I consider that these last two years of high school are going to bring me very good experiences, which I would regret losing for the rest of my life. At school, you become more confident, you learn social skills, you make friends, you are embarrassed, you have experiences, you talk about life with teachers, etc. In that sense, I feel that high school is useful."],
      ["subtitle", "How do you think high school could be improved?"],
      ["p", "Completely changing the subject system. I would put something like 20 subjects per course, and that each student can choose (without there being any mandatory) which subjects they want to study; in this way, you avoid the main problem of young people: the lack of interest in studying what they're being taught. I know it would be much more expensive and complicated to manage, but it's what I feel would give the students more freedom. I suppose you've heard some small child say that school is a prison. Why? Because they are forcing them to learn and memorize things that are of no use to them! And I understand that this helps create discipline in the student, but there comes a point where you realize that you are wasting time studying concepts that you are going to forget in two weeks."],
      ["subtitle", "Do the grades define the student?"],
      ["p", "Yes, but not in the way many think. Grades do not make you more or less intelligent, but they do determine how disciplined a student can be. There are stupid but disciplined people, at the same time, there are intelligent people but they don't know how to organize their lives. In that sense, the grades define how dynamic and responsible a student can be."],
      ["subtitle", "What would you recommend to another boy starting high school?"],
      ["p", "Let everything flow, that he is about to live the best years of his life in terms of growth, and that he should not overthink or invent imaginary problems like many young people do. If there is something he doesn't like that his classmates or teachers do to him, he shouldn't stay still and try to change it, and that later serves him a lot as a life experience (as happened to me)"]
    ]
  },
  "3": {
    "maintitle": "The worst year of my life",
    "description": "The weak boy becoming the most confident of his class. My hard maturation process.",
    "image": "/me4.jpeg",
    "content": [
      ["title", "The most difficult stage of my life"],
      ["p", "I was a weak, annoying, and cowardly boy. Nobody said anything to me because, in primary school, it was 'normal' for a kid to exhibit those behaviors. Then, when I started high school, things worsened. The only thing I was doing with my life was playing video games and watching videos on my computer. Nothing productive."],
      ["p", "My body weakened with each passing day until I reached a dark phase, and I began to change..."],
      ["subtitle", "2021 / 2024"],
      ["galery", ["/me4.jpeg", "/me3.jpeg"]],
      ["subtitle", "2021:"],
      ["p", "This was, by far, the worst year of my entire life. It began as I described before: I was a weak and annoying boy."],
      ["p", "When my second year of high school started, I didn’t have any friends because I changed schools after primary graduation. Due to the ongoing pandemic, the school year was divided into 'bubbles' of students, with some weeks being in-person and others virtual."],
      ["p", "The few people I talked to in 2020 weren't in my bubble, so I had to make new friends because there weren't many options. It was difficult to interact with kids from other groups due to the pandemic restrictions, and even talking with my own classmates was challenging."],
      ["p", "Unfortunately, I ended up in a group of aimless, misogynistic, and foolish boys. Since I was the best student in my class, they used to ask me for homework because, according to them, it was a form of 'friendship'."],
      ["p", "They manipulated me in a lot of ways. I won't go into detail about all the situations because I don't want to relive that year. In addition to the tough high school experience, my family noticed that I was becoming weaker and neglecting my physical appearance, causing them to lose their respect for me."],
      ["p", "And what did I do during my days? The same as the previous year: playing video games, listening to music, and doing absolutely nothing productive. I couldn't comprehend that all my suffering was due to my lifestyle, not just unlucky circumstances."],
      ["p", "By the end of the year, I was alone, weak, without family support, and no one was there to save me. November 2021 was the closest I had ever been to my breaking point, but then in December... things changed."],
      ["p", "While watching YouTube videos, I stumbled upon a specific and intriguing topic called 'self-improvement'. My family had always dismissed such content as stupid (yet ironically, they had never actually watched any of it). Initially, I rejected the idea, but my self-loathing was so intense that I forced myself to give it a chance."],
      ["p", "In those videos, I encountered some of the toughest lessons I had ever heard in December 2021: YOU are the only one responsible for your suffering, if people mistreat you, it's because they don't respect you, if you constantly complain, things won't change, pain equals change, and so on."],
      ["p", "It was then that I realized I had control over my life, and although it seemed impossible, I could change it."],
      ["subtitle", "2022:"],
      ["p", "January 1st, I said: \"This is going to be my best year\" (Spoiler: it wasn't, but...)"],
      ["p", "I began applying those principles, and my life started changing drastically. It was tough for a 15-year-old boy to come to terms with his perceived ugliness, and even tougher when people mocked his efforts to change. But what mattered most was that I never gave up."],
      ["p", "One of the most significant events of the year occurred in August-September when I experienced my first existential crisis. I questioned my daily struggle for improvement: What's the point? Why continue living and working when I'm just an insignificant person? Despite this crisis, I refused to give up. Instead, I delved into life philosophy, contemplating these existential questions, essential for future growth."],
      ["p", "It was a year filled with suffering, discipline, false friendships, shame, and self-hatred. I didn't start seeing results until the final months of the year, but what transpired next was nothing short of incredible to me."],
      ["galery", ["/me6.jpeg"]],
      ["subtitle", "2023:"],
      ["p", "Not the best year of my life, but it was the one in which I made the most progress. I discovered the benefits of regular exercise, learned how to cultivate genuine friendships, took up volleyball, and expanded my social circle. It was also the year I began learning web development and created my Twitter account."],
      ["p", "Most importantly: I found my personal style. Embracing messy hair and sports clothes made me feel more confident and attractive."],
      ["subtitle", "January 2023 / December 2023"],
      ["galery", ["/me2.jpeg", "/me1.jpeg"]],
      ["subtitle", "2024:"],
      ["p", "Was 2021 really three years ago? It felt like a decade, but what sticks with me is the transformation I've undergone. Self-improvement and challenges are my new lifestyle. This journey has made me incredibly confident. Those who once laughed at me in class now find themselves uneasy in my presence. Being the most confident person in a group is an indescribable feeling of triumph."],
      ["p", "I share my story not out of egocentrism but because I believe that anyone willing to endure the pain of change can create a remarkable life. My life stands as a testament to that truth."],
      ["p", "Am I satisfied with where I am now? I'll be honest: I'm grateful for the progress I've made, but I haven't yet reached my ultimate destination. I have countless plans and aspirations that drive me each morning, imagining the bright future that awaits me."],
      ["p", "I hope you, too, find your purpose and motivation to face each day with enthusiasm. Remember, if life treats you poorly, it's up to YOU to initiate change. While circumstances play a role, it's your determination and hard work that ultimately propel you forward. Without them, you'll remain stagnant."]
    ]
  },
  "4": {
    "maintitle": "My first games",
    "description": "From Fangames to entire communities. How horrible were my first creations?",
    "image": "/jw4.jpg",
    "content": [
      ["title", "My journey in game development"],
      ["p", "When I was 13 years old and I started programming in Game Maker (if you want to know more about this, read the article on the right side), the only thing I did was fangames of games that I liked. I loved a page called \"The Spriters Resource\", which contained images of any game you could think of."],
      ["p", "My first \"serious\" project was a Super Mario Fangame. It sounds super generic, but since I was a guy who liked to do things differently from everyone else, I added my own details. It was not a fangame of the original Mario Bros; it was one for Wii U called \"Paper Mario Color Splash\". I will not go into detail about what differentiates it from a normal Mario, because otherwise this article would become huge, but here are some images of how it looked:"],
      ["galery", ["/mario1.jpg", "/mario2.jpg"]],
      ["galery", ["/mario3.jpg", "/mario4.jpg"]],
      ["p", "Playing it was horrible. It had bugs that, since I didn't know how to solve them, I shamelessly left them in the final version. I showed this game in my \"Life Vision\", a presentation that sixth-grade students do as their final project. My teachers were impressed (they didn't know anything about game development so they didn't realize how horrible it was lol). From that moment, I knew I wanted to be a programmer. I didn't continue learning for reasons mentioned in this article."],
      ["link", ["/article/3", "The worst year of my life (The weak boy becoming the most confident of his class)"]],
      ["p", "There were several small fangames of Zelda, Counter Strike, Geometry Dash, and Metroid, which I never finished because I was young and I simply programmed what I wanted at that moment; I was not consistent with the projects."],
      ["p", "But when I turned 13, I started the project that would change my perspective on programming: Jumping World."],
      ["p", "It was 2020, and I used Discord a lot. There I met a friend who, by chance, also knew how to develop games with Game Maker. I showed him one of my Fangames, and since we were both bored in the middle of a pandemic, we decided to improve it and make it our own game."],
      ["p", "We created a Discord server and invited all the friends we had. Those friends invited other friends, and we ended up with more or less 20 active people on the server. We showed the first previews of the game, and people liked it. Later, we made (after MANY headaches) a level editor, and the community began to create their own levels, which made the server very active. It was the first time I worked with a community; people made recommendations, suggested changes, reported bugs, and I was there to try to keep everyone satisfied. Since it was a pandemic and school didn't take up too much of my time, I could afford it."],
      ["p", "Also, the friend I was developing the game with had much more knowledge of Game Maker than I did (I produced horrible and disastrous code, but it worked). After many criticisms and bugs that appeared, I was forced to make my code cleaner, which made me improve A LOT. I could say that thanks to my friend and that community, I'm now where I am, learning more about programming every day."],
      ["p", "Here are some images from the game:"],
      ["galery", ["/jw1.jpg", "/jw2.jpg"]],
      ["galery", ["/jw3.jpg", "/jw4.jpg"]],
      ["p", "A few months ago, in December 2023, my friend and I decided to remaster the game. We didn't spend much time on it since he's busy with his studies and I have been prioritizing other projects more, but I'm sure that one day we will finish the remaster and revive the community. This is a video that we shared as a preview:"],
      ["link", ["https://www.youtube.com/watch?v=GmSoohtjAng", "Jumping World 1-1 Showcase"]]
    ]
  },
  "5": {
    "maintitle": "My X journey",
    "description": "How I started and how I managed to reach where I am.",
    "image": "/twitter1.jpg",
    "content": [
      ["title", "Starting in my favorite social media right now"],
      ["p", "While learning JavaScript around September 2023, I decided to create a YouTube channel to showcase my first project. It was a fairly simple memory game, but one I was very proud of as my first \"big\" project. My initial plan was just to share my work on YouTube, but my father, who knows more about the world of programming than I do, recommended that I create a Twitter account and share my work there."],
      ["imgright", "/twitter1.jpg"],
      ["p", "I hesitated at first because I had heard negative things about the platform. I had the idea that it was mostly for discussing politics and engaging in meaningless dramas (which is partly true, but the niche I was getting into was moving away from those attitudes). Eventually, I was convinced, and I opened a Twitter account in September 2023. Initially, I didn't pay much attention to it, only occasionally posting a tweet, but in October, I decided to get serious."],
      ["p", "I only had 4 followers, so I decided to do something to start building an online presence: I would post tweets every day, comment on other people's posts, and start following many people in the community."],
      ["p", "Initially, it wasn't because of my tweets (which had almost no likes), but the comments made me grow. I have to admit, I was one of those people who said \"let's connect\" in every post I saw about this. It's embarrassing, but it had to start somehow."],
      ["imgleft", "/twitter2.jpg"],
      ["p", "That's when I saw several posts of people doing a challenge called \"100 days of code\". This type of posts caught my attention a lot. At first, I didn't know if they followed a set path or if they had mentors telling them what to do, but upon further investigation, I realized that it was simply like a diary of your daily learning."],
      ["p", "Without hesitation, I joined the challenge. At that time, I was learning the last topics of my first JavaScript course, and today, as I write this article (February 22, 2024), I'm on day 122. It's incredible the amount of things I've learned, the people I've known, the projects I've created, and the support I've received throughout this adventure. It was something I never imagined would end this way."],
      ["imgright", "/twitter3.jpg"],
      ["p", "And that has been my strategy from October 2023 to February 2024: 100 days of code, daily posts, and comments on other people tweets. I've tried different things such as threads, retweets, and quotes, but none of them have been as effective. I simply saw what worked for me, I was consistent, and I built my community."],
      ["subtitle", "What would you recommend to a person who is starting out in X?"],
      ["p", "1- Start: It may sound trivial, but just begin posting and engaging with the platform. You'll learn from your mistakes as you go along."],
      ["p", "2- Stand out: With thousands already doing what you're doing, differentiation is key to success. Find your unique angle or perspective."],
      ["p", "3- Experiment: Step out of your comfort zone. Remember, life is short, and you're not a celebrity. Feel free to try new things."],
      ["p", "4- Persistence and consistency: There will be weeks where you might lose followers despite your best efforts. This is normal. Stay dedicated and keep producing content."],
      ["p", "5- Cultivate fans, not just followers: Move beyond generic \"let's connect\" approaches. Provide genuine reasons for people to follow you. Be approachable and engage with other users, especially smaller accounts. You'll find it easy to make friends on this platform."],
      ["p", "In summary, the journey on X is a roller coaster. With only four months of experience, I can't offer too much, but these are the lessons I've learned so far. Remember to enjoy the process, not just the end result."]
    ]
  }
}